{
  "footerTagline": "«Бронювання 2.0, нове «Клієнти» та великі виправлення модалок.»",
  "entries": [
{
  "version": "3.6.0",
  "date": "2025-09-01",
  "title": "Бронювання 2.0, нове «Клієнти» та великі виправлення модалок",
  "items": [
    "Новий модуль бронювання: місячний календар + таймлайн дня 00:00–24:00 по столах, автоскрол до «зараз», швидке створення кліком, пошук клієнтів (autocomplete), мігаючі статуси «Скоро/У процесі», кнопка «Зберегти».",
    "Оновлено розділ «Клієнти»: чистий список, бейдж балансу під ім’ям, фільтри/сортування, пагінація, імпорт/експорт CSV, редагування у правому дроуері, керування бонусами.",
    "Виправлено критичний баг із неактивними полями після відкриття меню/модалок: єдиний контрольований бекдроп, фікс фокуса та z-index; шапка таблиці більше не перекриває дроуер.",
    "UI/UX: збільшено висоту модальних вікон, прибрано артефакти на кнопках «Редагувати/Видалити», підказки та гарячі клавіші (Esc).",
    "Продуктивність: тікер часу зупиняється, коли будь-яка модалка відкрита (включно з бронюванням), менше зайвих перерахунків.",
    "Дрібні покращення стилів, повідомлень та стабільності."
  ]
  },

    {
  "version": "3.5.4",
  "date": "2025-08-31",
  "title": "Новий вигляд столів, анімації та фікси бонусів",
  "items": [
    "Єдиний оновлений дизайн столів: рівна сітка, фіксована висота карток, «фетровий» фон, акуратні межі й тіні.",
    "Ергономічні кнопки: Start ↔ Pause з плавною анімацією, чіткі стани (disabled/busy), окремо Reset та Print+Reset.",
    "Бейдж «За бонуси» зроблено делікатним у стилі додатку, з м’якою появою та непомітною анімацією.",
    "Захист логіки бонусів: не можна запускати бонусну гру без гравців; якщо гравців прибрано — бонус-режим авто-вимикається.",
    "Автопауза при вичерпанні бонусів із повідомленням; витрата та нарахування рахуються коректно.",
    "Нарахування бонусів: режим «грн/год» або «% від нетто», рівномірний розподіл між гравцями, коректне округлення.",
    "Модал «Гравці»: пошук по імені/телефону, показ балансу, скрол, без переповнення за межі картки столу.",
    "Верхня панель вирівняна й інформативніша: бейдж зміни, кнопка «Що нового?» та відгуки.",
    "Виправлено «білий екран» (undefined lightOff): уніфікована функція вимкнення/паузи для стабільності.",
    "Прибрано «коричневі вилази» під столами; вирівняно відступи, ховери та фокус-стилі.",
    "Дрібні покращення продуктивності і стабільності: менше перерендерів, безпечні виклики ESP/принтера, інформативні помилки."
  ]
},

{
      "version": "3.5.3",
      "date": "2025-08-27",
      "title": "Акції, база користувачів, бонуси",
      "items": [
        "База клієнтів (користувачів) яким буде нараховано бонуси (поки що в ручну)",
        "Акції по дням тижня, налаштування знижок та інше",
        "Бонусна програма, списання, нарахування бонусів",
        "Будуть оновлення на покращення роботи, та візульних покращень"
      ]
    },

    {
      "version": "3.5.2",
      "date": "2025-08-24",
      "title": "Оновлена статистика",
      "items": [
        "Графіки та іформація за ними",
        "Візуалізація ігри за столами таїх статистика, вибір періода",
        "Візувальнио покращено статистика, показано останні ігри та їхній час"
      ]
    },

    {
      "version": "3.4.0",
      "date": "2025-08-24",
      "title": "Інформативне вікно оновлень, відгуки та пропозиції.",
      "items": [
        "Кнопка відлкуків та пропозицій",
        "Візуальні змінеи в ТОП Барі з анімаціями",
        "Футер: версія + посилання «Що нового?»."
      ]
    },

       
    {
      "version": "3.3.5",
      "date": "2025-08-20",
      "title": "Windows-білд + друк чеків",
      "items": [
        "NSIS інсталятор.",
        "ESC/POS друк чеків."
      ]
    }
  ]
}
